src/cf/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Артикул характеристики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Декларант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_МаркируемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганВыдавшийСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганЗарегистрировавшийДекларацию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СерияПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СертификатСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Фальсификат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_НаименованиеПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonForms/ФормаВыбораДанныхПоискаПоШтрихкоду/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияПоиска = Неопределено;
	Если НЕ Параметры.Свойство("ЗначенияПоиска", ЗначенияПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	// ор ++
	ЗаполнитьТаблицуНоменклатурыДляЦен(ЗначенияПоиска);
	Если ЭтотОбъект.ТаблицаНоменклатурыДляЦен.Количество() > 0 Тогда
		
		НастройкиВыбора = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиФормыВыбораДанныхПоискаПоШК", "");
		Если ТипЗнч(НастройкиВыбора) = Тип("Структура") Тогда
			
			Если НастройкиВыбора.Свойство("ПоказыватьЦеныНоменклатуры") Тогда
				ЭтотОбъект.ПоказыватьЦеныНоменклатуры = НастройкиВыбора.ПоказыватьЦеныНоменклатуры;
			КонецЕсли;
			
		КонецЕсли;
		
		ЭтотОбъект.РозничныйВидЦены = Неопределено;
		Параметры.Свойство("РозничныйВидЦены", ЭтотОбъект.РозничныйВидЦены);
		
		Элементы.ТаблицаВыбораЦена.Видимость = ЭтотОбъект.ПоказыватьЦеныНоменклатуры;
		
	Иначе
		
		Элементы.ТаблицаВыбораЦена.Видимость = Ложь;
		Элементы.ГруппаПоказыватьЦену.Видимость = Ложь;
		
	КонецЕсли;
	// ор --
	
	ЗаполнитьТаблицуНоменклатурыДляОстатков(ЗначенияПоиска);
	
	ЭтоБазоваяРМК = ОбщегоНазначенияРМК.ЭтоБазоваяРМК();
	Элементы.ГруппаПоказыватьОстаток.Видимость = Не ЭтоБазоваяРМК;
	
	Если ЭтоБазоваяРМК И ТаблицаНоменклатурыДляОстатков.Количество() > 0
		И Параметры.Свойство("ОтображатьОстаток", ПоказыватьОстатокНоменклатуры) Тогда
		
		Элементы.КолонкиОстатка.Видимость = ПоказыватьОстатокНоменклатуры;
		СкладОстатков = Параметры.ТорговыйОбъект;
		
	ИначеЕсли Не ЭтоБазоваяРМК И ТаблицаНоменклатурыДляОстатков.Количество() > 0 Тогда
		
		НастройкиВыбора = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиФормыВыбораДанныхПоискаПоШК", "");
		Если ТипЗнч(НастройкиВыбора) = Тип("Структура") Тогда
			Если НастройкиВыбора.Свойство("ПоказыватьОстатокНоменклатуры") Тогда
				ПоказыватьОстатокНоменклатуры = НастройкиВыбора.ПоказыватьОстатокНоменклатуры;
			КонецЕсли;
			Если НастройкиВыбора.Свойство("СкладОстатков") Тогда
				СкладОстатков = НастройкиВыбора.СкладОстатков;
			КонецЕсли;
			// ор ++
			Если НастройкиВыбора.Свойство("ОтображатьТолькоТоварыНаОстатках") Тогда
				ЭтотОбъект.ОтображатьТолькоТоварыНаОстатках = НастройкиВыбора.ОтображатьТолькоТоварыНаОстатках;
			КонецЕсли;
			// ор --
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СкладОстатков) Тогда
			РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьТекущийСклад(СкладОстатков);
		КонецЕсли;
		
		Элементы.СкладОстатков.Доступность = ПоказыватьОстатокНоменклатуры;
		Элементы.КолонкиОстатка.Видимость = ПоказыватьОстатокНоменклатуры;
		
	Иначе
		
		Если Параметры.Свойство("ПоказыватьБонусы") Тогда
			Элементы.ТаблицаВыбораШаблонШтрихкода.Видимость = Ложь;
			Элементы.КолонкиОстатка.Видимость = Параметры.ПоказыватьБонусы;
			Элементы.ТаблицаВыбораРезерв.Видимость = Ложь;
		Иначе
			Элементы.КолонкиОстатка.Видимость = Ложь;
		КонецЕсли;
		Элементы.СкладОстатков.Доступность 			= Ложь;
		Элементы.ГруппаПоказыватьОстаток.Видимость	= Ложь;
		
	КонецЕсли;
		
	Параметры.Свойство("Штрихкод", Штрихкод);
	Параметры.Свойство("ДанныеПО", Штрихкод);
	Параметры.Свойство("МагнитныйКод", МагнитныйКод);
	Элементы.ТаблицаВыбораВыбрана.Видимость = Ложь;
	Элементы.ТаблицаВыбораКодПоиска.Видимость = Ложь;
	СтрокаЗаголовка = "";
	
	Если ЗначениеЗаполнено(Штрихкод) Тогда
		СтрокаЗаголовка = НСтр("ru = 'Найдено по штрихкоду: %1'");
		СтрокаЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаЗаголовка, Штрихкод);
	Иначе
		СтрокаЗаголовка = НСтр("ru = 'Найдено по магнитному коду: %1'");
		СтрокаЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаЗаголовка, МагнитныйКод);
	КонецЕсли;
	
	ЭтотОбъект.Заголовок = СтрокаЗаголовка;
	ЭтотОбъект.АвтоЗаголовок = Ложь;
	
	СтрокиДерева = ДеревоВыбора.ПолучитьЭлементы();
	
	СтруктураВыбораНомераТелефона = Неопределено;
	СтруктураВыбораАдресаЭП = Неопределено;
	СтруктураВыбораСоздатьКарту = Неопределено;
	Элементы.ТаблицаВыбораЗаписатьНомерТелефона.Видимость = Ложь;
	Элементы.ТаблицаВыбораЗаписатьАдресЭП.Видимость = Ложь;
	Элементы.ТаблицаВыбораСоздатьКарту.Видимость = Ложь;
	
	Для Каждого СтрокаВыбора Из ЗначенияПоиска Цикл
		
		Если СтрокаВыбора.Владелец = Неопределено Тогда
			
			Если СтрокаВыбора.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.Телефон Тогда
				Элементы.ТаблицаВыбораЗаписатьНомерТелефона.Видимость = Истина;
				СтруктураВыбораНомераТелефона = СтрокаВыбора;
			ИначеЕсли СтрокаВыбора.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.АдресЭП Тогда
				Элементы.ТаблицаВыбораЗаписатьАдресЭП.Видимость = Истина;
				СтруктураВыбораАдресаЭП = СтрокаВыбора;
			ИначеЕсли СтрокаВыбора.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.Карта Тогда
				Элементы.ТаблицаВыбораСоздатьКарту.Видимость = Истина;
				СтруктураВыбораСоздатьКарту = СтрокаВыбора;
			КонецЕсли;
		
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = СтрокиДерева.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыбора);
		
		// ор ++
		Если ТипЗНЧ(СтрокаВыбора.Характеристика) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры")
			И ЗначениеЗаполнено(СтрокаВыбора.Характеристика.ор_СрокГодности) Тогда
			НоваяСтрока.ор_СрокГодности = СтрокаВыбора.Характеристика.ор_СрокГодности;
		КонецЕсли;
		// ор --
		
		Если НЕ НоваяСтрока.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.Телефон
			И НЕ НоваяСтрока.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.АдресЭП
			И НЕ НоваяСтрока.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.НоменклатураВесовой Тогда
			НоваяСтрока.ШаблонШтрихкода = Перечисления.ШаблоныШтрихкодов.ПустаяСсылка();
		КонецЕсли;
		
		НоваяСтрока.ПредставлениеОбъекта =
		"" + СтрокаВыбора.Владелец
		+ ?(ЗначениеЗаполнено(СтрокаВыбора.Характеристика), ", " + СтрокаВыбора.Характеристика , "")
		+ ?(ЗначениеЗаполнено(СтрокаВыбора.Упаковка), ", " + СтрокаВыбора.Упаковка, "");
		
		РаботаСоШтрихкодамиПереопределяемый.ДополнитьСтрокуТаблицыВыбора(НоваяСтрока, СтрокаВыбора);
		
		Если СтрокаВыбора.Свойство("АктивизироватьСтроку") Тогда
			Элементы.ТаблицаВыбора.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ТаблицаВыбора.ТолькоПросмотр = Истина;
	
	Если ПоказыватьОстатокНоменклатуры Тогда
		ОбновитьОстаткиНоменклатурыВДереве();
	КонецЕсли;
	
	// ор ++
	Если ЭтотОбъект.ПоказыватьЦеныНоменклатуры Тогда
		ОбновитьЦеныНоменклатурыВДереве();
	КонецЕсли;
	Элементы.ОтображатьТолькоТоварыНаОстатках.Видимость = ПоказыватьОстатокНоменклатуры;
	// ор --
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТаблицаВыбора;
	
	МРЦ = 0;
	Если Параметры.Свойство("ПоказатьКолонкуЦена") Тогда
		Элементы.ТаблицаВыбораЦена.Видимость = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("МРЦ", МРЦ) Тогда
		Элементы.ДекорацияПодсказка.Видимость = Истина;
		Элементы.ТаблицаВыбораЦена.Видимость = Истина;
		Элементы.ТаблицаВыбораЦена.Заголовок = СтрШаблон(НСтр("ru = 'Цена  (МРЦ=%1)'"), МРЦ);
		
		Если Элементы.ТаблицаВыбора.ТекущаяСтрока = Неопределено Тогда
			Элементы.ДекорацияПодсказка.Заголовок =
				СтрШаблон(НСтр("ru = 'МРЦ=%1. Отсутствует товар с соответствующей ценой.'"), МРЦ);
		Иначе
			Элементы.ДекорацияПодсказка.Заголовок = СтрШаблон(НСтр("ru = 'МРЦ=%1.'"), МРЦ);
		КонецЕсли;
		
	КонецЕсли;
	
	Параметры.Свойство("ПараметрыШтрихкода", ПараметрыШтрихкода);
	
	// Аптека ++
	ор_ОбщегоНазначенияСервер.ЗаполнитьТаблицуИндикацииСерийПоСрокамГодности(ЭтотОбъект.ТаблицаИндикацииСерий);
	ЗаполнитьУсловноеОформлениеФормыИндикацииСерийПоСрокамГодности();
	// Аптека -
	УстановитьУсловноеОформление();
	
	Если НЕ КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_5 Тогда
		Элементы.Переместить(Элементы.ТаблицаВыбораВыбрать, Элементы.ГруппаКоманднаяПанель,
			Элементы.ТаблицаВыбораЗаписатьНомерТелефона);
	КонецЕсли;
	ИспользоватьНастройкиКаталога = Истина;
	УстановитьВидимостьЭлементаФормы(Элементы.НастройкаКаталогаПереключитьНастройку, Ложь);
	СоздатьЭлементыНастроекКаталога();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Элементы.ТаблицаВыбора.ТекущаяСтрока = Неопределено Тогда
		Элементы.ТаблицаВыбора.ТекущаяСтрока = 0;
		Элементы.ТаблицаВыбора.ТекущаяСтрока = Неопределено;
	КонецЕсли;
	
	НастроитьОтображениеКаталогаПриОткрытии();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СкладОстатковПриИзменении(Элемент)
	СкладОстатковПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьОстатокНоменклатурыПриИзменении(Элемент)
	ПоказыватьОстатокНоменклатурыПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаВыбора

&НаКлиенте
Процедура ТаблицаВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные.КартаНедействительна Тогда
		ТекстСообщения = НСтр("ru = 'Дисконтная карта %1 недействительна'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
			ТекущиеДанные.ПредставлениеОбъекта);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	Иначе
		Закрыть(ПодготовитьСтруктуруВыбора());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораВыбранаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаВыбора.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПодчиненныеСтроки = ТекущаяСтрока.ПолучитьЭлементы();
		Для Каждого ПодчиненнаяСтрока Из ПодчиненныеСтроки Цикл
			ПодчиненнаяСтрока.Выбрана = ТекущаяСтрока.Выбрана;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(ПодготовитьСтруктуруВыбора());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНомерТелефона(Команда)
	
	Закрыть(ПодготовитьСтруктуруВыбора(СтруктураВыбораНомераТелефона));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьАдресЭП(Команда)
	
	Закрыть(ПодготовитьСтруктуруВыбора(СтруктураВыбораАдресаЭП));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКарту(Команда)
	
	Закрыть(ПодготовитьСтруктуруВыбора(СтруктураВыбораСоздатьКарту));
	
КонецПроцедуры

#Область КомандыНастройкиКаталога

&НаКлиенте
Процедура КомандаПолеКаталогаКнопка(Команда)
	
	НомерПоля = СтрЗаменить(Команда.Имя,"ПолеКаталогаКнопка_", "");
	ИмяПоля = НастройкаКаталогаИменаПолей.НайтиПоИдентификатору(НомерПоля);
	ИмяКолонки = СтрЗаменить(ИмяПоля, "ДеревоВыбора.", "");
	
	ЗначениеСписка = НастройкаКаталогаКолонкиОтключенные.НайтиПоЗначению(ИмяКолонки);
	
	Если ЗначениеСписка = Неопределено Тогда
		НастройкаКаталогаКолонкиОтключенные.Добавить(ИмяКолонки);
		УстановитьВидимостьЭлементаФормы(Элементы.Найти("ТаблицаВыбора" + ИмяКолонки), Ложь);
		КартинкаКнопки = БиблиотекаКартинок.СкрытьПароль;
	Иначе
		НастройкаКаталогаКолонкиОтключенные.Удалить(ЗначениеСписка);
		УстановитьВидимостьЭлементаФормы(Элементы["ТаблицаВыбора" + ИмяКолонки], Истина);
		КартинкаКнопки = БиблиотекаКартинок.ПоказатьПароль;
	КонецЕсли;
	
	Элементы[Команда.Имя].Картинка = КартинкаКнопки;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКаталогаОткрытьНастройки(Команда)
	Элементы.ГруппаНастройкиКаталогаВсплывающая.Показать();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКаталогаПоУмолчанию(Команда)
	
	ВосстановитьВидимостьПоУмолчанию();
	Элементы.ГруппаНастройкиКаталогаВсплывающая.Скрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКаталогаЗакрыть(Команда)
	Элементы.ГруппаНастройкиКаталогаВсплывающая.Скрыть();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКаталогаПереключитьНастройку(Команда)
	
	НастройкаКаталогаТекущаяНастройкаПолей = НастройкаКаталогаТекущаяНастройкаПолей + 1;
	
	Если НастройкаКаталогаТекущаяНастройкаПолей = 3 Тогда
		НастройкаКаталогаТекущаяНастройкаПолей = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПодготовитьСтруктуруВыбора(ТекущиеДанные = Неопределено)
	
	СтруктураРезультат = СтруктураДанныхПоиска();
	СтруктураРезультат.НеизвестныеДанныеПО = Ложь;
	СтруктураРезультат.ПараметрыШтрихкода = ПараметрыШтрихкода;
	
	Если ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = Элементы.ТаблицаВыбора.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		СтруктураСтроки = Новый Структура;
		Если ЗначениеЗаполнено(Штрихкод) Тогда
			СтруктураСтроки.Вставить("Штрихкод", Штрихкод);
			СтруктураСтроки.Вставить("МагнитныйКод", "");
			СтруктураСтроки.Вставить("ДанныеПО", Штрихкод);
			СтруктураРезультат.ДанныеПО = Штрихкод;
			СтруктураРезультат.ТипДанныхПО = "Штрихкод";
		Иначе
			СтруктураСтроки.Вставить("Штрихкод", "");
			СтруктураСтроки.Вставить("МагнитныйКод", МагнитныйКод);
			СтруктураСтроки.Вставить("ДанныеПО", МагнитныйКод);
			СтруктураРезультат.ДанныеПО = МагнитныйКод;
			СтруктураРезультат.ТипДанныхПО = "МагнитныйКод";
		КонецЕсли;
		
		СтруктураСтроки.Вставить("ШаблонШтрихкода", ТекущиеДанные.ШаблонШтрихкода);
		СтруктураСтроки.Вставить("ТипОбъекта", ТекущиеДанные.ТипОбъекта);
		
		СтруктураСтроки.Вставить("Владелец", ТекущиеДанные.Владелец);
		СтруктураСтроки.Вставить("Характеристика", ТекущиеДанные.Характеристика);
		СтруктураСтроки.Вставить("Упаковка", ТекущиеДанные.Упаковка);
		СтруктураСтроки.Вставить("СерияНоменклатуры", ТекущиеДанные.СерияНоменклатуры);
		СтруктураСтроки.Вставить("Количество", ТекущиеДанные.Количество);
		
		Если Не ПараметрыШтрихкода = Неопределено Тогда
			ДанныеМаркировки = ПараметрыШтрихкода.ДанныеМаркировки;
		Иначе
			ДанныеМаркировки = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(Штрихкод);
		КонецЕсли;
		
		Если ТипЗнч(ДанныеМаркировки) = Тип("Структура") Тогда
			Если ДанныеМаркировки.Свойство("Разобран") И ДанныеМаркировки.Разобран Тогда
				СтруктураСтроки.Вставить("ДанныеМаркировки", ДанныеМаркировки);
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого ДополнительныйПараметр Из ТекущиеДанные.ДополнительныеДанные Цикл
			СтруктураСтроки.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
		КонецЦикла;
		
		СтруктураРезультат.ЗначенияПоиска.Добавить(СтруктураСтроки);
		
		ДополнитьСтруктуруДляРегистрацииНовогоОбъекта(СтруктураРезультат);
		
	КонецЕсли;
	
	Возврат СтруктураРезультат;
	
КонецФункции

// Формирует предопределенную структуру,
// Которая используется при поиске по ШК.
//
// Возвращаемое значение:
//  Структура - структура данных поиска.
//
&НаКлиенте
Функция СтруктураДанныхПоиска()
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ЗначенияПоиска", Новый Массив);
	СтруктураПараметров.Вставить("НеизвестныеДанныеПО", Истина);
	СтруктураПараметров.Вставить("ДанныеПО", "");
	СтруктураПараметров.Вставить("ТипДанныхПО", "Штрихкод");
	СтруктураПараметров.Вставить("ПараметрыШтрихкода", Новый Структура);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Процедура ДополнитьСтруктуруДляРегистрацииНовогоОбъекта(СтруктураПараметров)
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("РегистрацияНовойКарты");
	НеизвестныеДанныеПО = Ложь;
	
	РаботаСоШтрихкодамиПереопределяемый.СкорректироватьСтруктуруРезультата(
			СтруктураПараметров,
			Штрихкод,
			СтруктураДействий,
			НеизвестныеДанныеПО,
			Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПоказыватьОстатокНоменклатурыПриИзмененииНаСервере()
	
	Элементы.СкладОстатков.Доступность = ПоказыватьОстатокНоменклатуры;
	Элементы.КолонкиОстатка.Видимость = ПоказыватьОстатокНоменклатуры;
	НастройкиВыбора = Новый Структура;
	НастройкиВыбора.Вставить("ПоказыватьОстатокНоменклатуры", ПоказыватьОстатокНоменклатуры);
	НастройкиВыбора.Вставить("СкладОстатков", СкладОстатков);
	// + ор
	НастройкиВыбора.Вставить("ПоказыватьЦеныНоменклатуры", ЭтотОбъект.ПоказыватьЦеныНоменклатуры);
	// - ор
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("НастройкиФормыВыбораДанныхПоискаПоШК", "", НастройкиВыбора);
	Если ПоказыватьОстатокНоменклатуры Тогда
		ОбновитьОстаткиНоменклатурыВДереве();
	КонецЕсли;
	
	// ор ++
	Элементы.ОтображатьТолькоТоварыНаОстатках.Видимость = ПоказыватьОстатокНоменклатуры;
	// ор --
	
КонецПроцедуры

&НаСервере
Процедура СкладОстатковПриИзмененииНаСервере()
	ОбновитьОстаткиНоменклатурыВДереве();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОстаткиНоменклатурыВДереве()
	
	ТаблицаОстатков = ТаблицаНоменклатурыДляОстатков.Выгрузить();
	ИсходнаяТаблица = ТаблицаНоменклатурыДляОстатков.Выгрузить();
	РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьОстаткиПоСкладу(ИсходнаяТаблица, СкладОстатков, ТаблицаОстатков);
	ТаблицаНоменклатурыДляОстатков.Загрузить(ТаблицаОстатков);
	ОбновитьОстаткиВСтроках();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОстаткиВСтроках(ТекущаяСтрока = Неопределено)
	
	Если ТекущаяСтрока = Неопределено Тогда
		СтрокиДерева = ДеревоВыбора.ПолучитьЭлементы();
	Иначе
		СтрокиДерева = ТекущаяСтрока.ПолучитьЭлементы();
	КонецЕсли;
	
	Для Каждого ПодчиненнаяСтрока Из СтрокиДерева Цикл
		Если ПодчиненнаяСтрока.ОтображатьОстатки Тогда
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Номенклатура", ПодчиненнаяСтрока.Номенклатура);
			СтруктураПоиска.Вставить("Характеристика", ПодчиненнаяСтрока.Характеристика);
			СтрокиОстатков = ТаблицаНоменклатурыДляОстатков.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаОстатка Из СтрокиОстатков Цикл
				ПодчиненнаяСтрока.Остаток = СтрокаОстатка.Остаток;
				ПодчиненнаяСтрока.Резерв = СтрокаОстатка.Резерв;
				Прервать;
			КонецЦикла;
		КонецЕсли;
		ОбновитьОстаткиВСтроках(ПодчиненнаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНоменклатурыДляОстатков(ЗначенияПоиска)
	
	Для Каждого СтрокаВыбора Из ЗначенияПоиска Цикл
		Если СтрокаВыбора.Свойство("ОтображатьОстатки") Тогда
			НоваяСтрокаНоменклатуры = ТаблицаНоменклатурыДляОстатков.Добавить();
			НоваяСтрокаНоменклатуры.Номенклатура = СтрокаВыбора.Номенклатура;
			НоваяСтрокаНоменклатуры.Характеристика = СтрокаВыбора.Характеристика;
			НоваяСтрокаНоменклатуры.Упаковка = СтрокаВыбора.Упаковка;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеСписок = Элемент.Поля.Элементы.Добавить();
	ПолеСписок.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаВыбора.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоВыбора.КартаНедействительна");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаПредупреждения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементаФормы(Элемент, Знач Видимость)
	Элемент.Видимость = Видимость;
КонецПроцедуры

#Область НастройкиКаталога

&НаСервере
Процедура СоздатьЭлементыНастроекКаталога()
	
	Если ИспользоватьНастройкиКаталога Тогда
		УстановитьВидимостьЭлементаФормы(Элементы.НастройкаКаталогаОткрытьНастройки, Истина);
	Иначе
		УстановитьВидимостьЭлементаФормы(Элементы.НастройкаКаталогаОткрытьНастройки, Ложь);
		Возврат;
	КонецЕсли;
	
	НастройкаКаталогаИменаПолей.Очистить();
	
	КолонкиСписка = Новый Массив;
	КолонкиСписка.Добавить(Элементы.ТаблицаВыбораТипОбъекта);
	КолонкиСписка.Добавить(Элементы.ТаблицаВыбораШаблонШтрихкода);
	КолонкиСписка.Добавить(Элементы.КолонкиОстатка);
	КолонкиСписка.Добавить(Элементы.ТаблицаВыбораЦена);
	
	Для Каждого КолонкаСписка Из КолонкиСписка Цикл
		Если Не КолонкаСписка.Видимость Тогда
			Продолжить;
		КонецЕсли;
		Если КолонкаСписка.Вид = ВидГруппыФормы.ГруппаКолонок Тогда
			Для Каждого КолонкаГруппы Из КолонкаСписка.ПодчиненныеЭлементы Цикл
				Если КолонкаГруппы.Видимость И ЗначениеЗаполнено(КолонкаГруппы.ПутьКДанным) Тогда
					ДобавитьПолеВНастройкиКаталогаИменаПолей(НастройкаКаталогаИменаПолей,
						ЗаголовкиПолей, КолонкаГруппы);
				КонецЕсли;
			КонецЦикла;
		Иначе
			Если ЗначениеЗаполнено(КолонкаСписка.ПутьКДанным) Тогда
				ДобавитьПолеВНастройкиКаталогаИменаПолей(НастройкаКаталогаИменаПолей,
					ЗаголовкиПолей, КолонкаСписка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ИмяРодительскойГруппы = "ГруппаНастройкиКаталогаПоляПоиска";
	ЭлементГруппаПолей = Элементы[ИмяРодительскойГруппы];
	НомПП = 0;
	Для Каждого ИмяПоляКаталога Из НастройкаКаталогаИменаПолей Цикл
		
		ИмяКолонки = НомПП;
		ИмяКоманды = "ПолеКаталогаКнопка_" + ИмяКолонки;
		НоваяКоманда = Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Действие = "КомандаПолеКаталогаКнопка";
		НоваяКоманда.Заголовок = ИмяКолонки;
		
		КнопкаПолеПоискаКаталога = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ЭлементГруппаПолей);
		КнопкаПолеПоискаКаталога.ИмяКоманды = ИмяКоманды;
		КнопкаПолеПоискаКаталога.РастягиватьПоГоризонтали = Истина;
		КнопкаПолеПоискаКаталога.Высота = 2;
		КнопкаПолеПоискаКаталога.Картинка = БиблиотекаКартинок.ПоказатьПароль;
		КнопкаПолеПоискаКаталога.Отображение = ОтображениеКнопки.КартинкаИТекст;
		КнопкаПолеПоискаКаталога.ПоложениеКартинки = ПоложениеКартинкиКнопкиФормы.Лево;
		КнопкаПолеПоискаКаталога.Фигура = ФигураКнопки.Овал;
		
		КнопкаПолеПоискаКаталога.Заголовок = ЗаголовкиПолей.НайтиПоЗначению(ИмяПоляКаталога.Значение).Представление;
		
		НомПП = НомПП + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьПолеВНастройкиКаталогаИменаПолей(НастройкаКаталогаИменаПолей, ЗаголовкиПолей, Знач ПолеФормы)
	
	ИмяКолонки = СтрЗаменить(ПолеФормы.ПутьКДанным, "Список.", "");
	НастройкаКаталогаИменаПолей.Добавить(ИмяКолонки);
	Если ЗначениеЗаполнено(ПолеФормы.Заголовок) Тогда
		ЗаголовкиПолей.Добавить(ИмяКолонки, ПолеФормы.Заголовок);
	Иначе
		ЗаголовкиПолей.Добавить(ИмяКолонки, СтрЗаменить(ИмяКолонки, "ДеревоВыбора.", ""));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтображениеКаталогаПриОткрытии()
	
	Если НЕ ИспользоватьНастройкиКаталога Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьПоляКаталогаПриОткрытии();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПоляКаталогаПриОткрытии()
	
	Для Каждого Колонка Из НастройкаКаталогаКолонкиОтключенные Цикл
		
		ИмяКолонки = Колонка.Значение;
		НомПП = 0;
		Для Каждого ИмяПоля Из НастройкаКаталогаИменаПолей Цикл
			Если ИмяПоля.Значение = "ДеревоВыбора." + ИмяКолонки Тогда
				УстановитьВидимостьЭлементаФормы(Элементы.Найти("ТаблицаВыбора" + ИмяКолонки), Ложь);
				КартинкаКнопки = БиблиотекаКартинок.СкрытьПароль;
				Элементы["ПолеКаталогаКнопка_" + НомПП].Картинка = КартинкаКнопки;
				Прервать;
			КонецЕсли;
			НомПП = НомПП + 1;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьВидимостьПоУмолчанию()
	
	НомПП = 0;
	Для Каждого ИмяПоля Из НастройкаКаталогаИменаПолей Цикл
		ИмяКолонки = СтрЗаменить(ИмяПоля.Значение, "ДеревоВыбора.", "");
		УстановитьВидимостьЭлементаФормы(Элементы.Найти("ТаблицаВыбора" + ИмяКолонки), Истина);
		КартинкаКнопки = БиблиотекаКартинок.ПоказатьПароль;
		Элементы["ПолеКаталогаКнопка_" + НомПП].Картинка = КартинкаКнопки;
		НомПП = НомПП + 1;
	КонецЦикла;
	
	НастройкаКаталогаКолонкиОтключенные.Очистить();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОтраслевыеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ПоказыватьЦеныНоменклатурыПриИзменении(Элемент)
	ПоказыватьЦеныНоменклатурыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоказыватьЦеныНоменклатурыПриИзмененииНаСервере()
	
	Элементы.ТаблицаВыбораЦена.Видимость = ЭтотОбъект.ПоказыватьЦеныНоменклатуры;
	НастройкиВыбора = Новый Структура;
	НастройкиВыбора.Вставить("ПоказыватьОстатокНоменклатуры", ПоказыватьОстатокНоменклатуры);
	НастройкиВыбора.Вставить("СкладОстатков", СкладОстатков);
	НастройкиВыбора.Вставить("ПоказыватьЦеныНоменклатуры", ЭтотОбъект.ПоказыватьЦеныНоменклатуры);
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("НастройкиФормыВыбораДанныхПоискаПоШК", "", НастройкиВыбора);
	Если ЭтотОбъект.ПоказыватьЦеныНоменклатуры Тогда
		ОбновитьЦеныНоменклатурыВДереве();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЦеныНоменклатурыВДереве()
	
	ТаблицаЦен = ЭтотОбъект.ТаблицаНоменклатурыДляЦен.Выгрузить();
	ИсходнаяТаблицаЦен = ЭтотОбъект.ТаблицаНоменклатурыДляЦен.Выгрузить();
	ЗаполнитьЦены(ИсходнаяТаблицаЦен, ТаблицаЦен);
	ЭтотОбъект.ТаблицаНоменклатурыДляЦен.Загрузить(ТаблицаЦен);
	ОбновитьЦеныВСтроках();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЦеныВСтроках(ТекущаяСтрока = Неопределено)
	
	Если ТекущаяСтрока = Неопределено Тогда
		СтрокиДерева = ДеревоВыбора.ПолучитьЭлементы();
	Иначе
		СтрокиДерева = ТекущаяСтрока.ПолучитьЭлементы();
	КонецЕсли;
	
	Для Каждого ПодчиненнаяСтрока Из СтрокиДерева Цикл
		Если ПодчиненнаяСтрока.ОтображатьЦены Тогда
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Номенклатура", ПодчиненнаяСтрока.Владелец);
			СтруктураПоиска.Вставить("Характеристика", ПодчиненнаяСтрока.Характеристика);
			СтрокиЦен = ЭтотОбъект.ТаблицаНоменклатурыДляЦен.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаЦены Из СтрокиЦен Цикл
				ПодчиненнаяСтрока.Цена = СтрокаЦены.Цена;
				Прервать;
			КонецЦикла;
		КонецЕсли;
		ОбновитьЦеныВСтроках(ПодчиненнаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНоменклатурыДляЦен(ЗначенияПоиска)
	
	Для Каждого СтрокаВыбора Из ЗначенияПоиска Цикл
		Если СтрокаВыбора.Свойство("ОтображатьЦены") Тогда
			НоваяСтрокаНоменклатуры = ЭтотОбъект.ТаблицаНоменклатурыДляЦен.Добавить();
			НоваяСтрокаНоменклатуры.Номенклатура = СтрокаВыбора.Владелец;
			НоваяСтрокаНоменклатуры.Характеристика = СтрокаВыбора.Характеристика;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦены(ИсходнаяТаблицаЦен, ТаблицаЦен)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	&ТаблицаТоваров КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.Номенклатура КАК Номенклатура,
		|	втТовары.Характеристика КАК Характеристика,
		|	СпрНоменклатура.ЭтоНабор КАК ЭтоНабор,
		|	СпрНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	СпрНоменклатура.Номинал КАК Номинал
		|ПОМЕСТИТЬ ТаблицаНоменклатура
		|ИЗ
		|	втТовары КАК втТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО втТовары.Номенклатура = СпрНоменклатура.Ссылка
		|ГДЕ
		|	НЕ СпрНоменклатура.ПометкаУдаления
		|	И НЕ СпрНоменклатура.ЭтоГруппа
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
		|	МАКСИМУМ(ЕСТЬNULL(ЦеныНоменклатуры.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК Период,
		|	ЕСТЬNULL(ЦеныНоменклатуры.ВидЦен, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ВидЦен,
		|	0 КАК Номинал,
		|	ТаблицаНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры
		|ПОМЕСТИТЬ ТаблицаМаксПериодЦен
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|		И ТаблицаНоменклатура.Характеристика = ЦеныНоменклатуры.Характеристика
		|ГДЕ
		|	ЦеныНоменклатуры.Период <= &Дата
		|	И ЦеныНоменклатуры.ВидЦен = &ВидЦены
		|	И ЦеныНоменклатуры.Актуальность
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ЦеныНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
		|	ЕСТЬNULL(ЦеныНоменклатуры.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
		|	ЕСТЬNULL(ЦеныНоменклатуры.ВидЦен, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)),
		|	ТаблицаНоменклатура.ТипНоменклатуры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	&Дата,
		|	&ВидЦены,
		|	0,
		|	ТаблицаНоменклатура.ТипНоменклатуры
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|ГДЕ
		|	ТаблицаНоменклатура.ЭтоНабор
		|	И ЦеныНоменклатуры.Номенклатура ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНоменклатура.Номенклатура,
		|	ТаблицаНоменклатура.ТипНоменклатуры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	&Дата,
		|	&ВидЦены,
		|	ТаблицаНоменклатура.Номинал,
		|	ТаблицаНоменклатура.ТипНоменклатуры
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|ГДЕ
		|	ТаблицаНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНоменклатура.Номенклатура,
		|	ТаблицаНоменклатура.Номинал,
		|	ТаблицаНоменклатура.ТипНоменклатуры
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	ВидЦен,
		|	Номенклатура,
		|	Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаМаксПериодЦен.Номенклатура КАК Номенклатура,
		|	ТаблицаМаксПериодЦен.Характеристика КАК Характеристика,
		|	ТаблицаМаксПериодЦен.Период КАК Период,
		|	ТаблицаМаксПериодЦен.ВидЦен КАК ВидЦен,
		|	ВЫБОР
		|		КОГДА ТаблицаМаксПериодЦен.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
		|			ТОГДА ТаблицаМаксПериодЦен.Номинал
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
		|	КОНЕЦ КАК Цена
		|ПОМЕСТИТЬ ТаблицаИтоговыхЦен
		|ИЗ
		|	ТаблицаМаксПериодЦен КАК ТаблицаМаксПериодЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТаблицаМаксПериодЦен.Период = ЦеныНоменклатуры.Период
		|			И ТаблицаМаксПериодЦен.ВидЦен = ЦеныНоменклатуры.ВидЦен
		|			И ТаблицаМаксПериодЦен.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|			И ТаблицаМаксПериодЦен.Характеристика = ЦеныНоменклатуры.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура КАК Номенклатура,
		|	ТаблицаНоменклатура.Характеристика КАК Характеристика,
		|	ЕСТЬNULL(ТаблицаИтоговыхЦен.Цена, 0) КАК Цена
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИтоговыхЦен КАК ТаблицаИтоговыхЦен
		|		ПО ТаблицаНоменклатура.Номенклатура = ТаблицаИтоговыхЦен.Номенклатура
		|			И ТаблицаНоменклатура.Характеристика = ТаблицаИтоговыхЦен.Характеристика
		|";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	&ТаблицаТоваров КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.Номенклатура КАК Номенклатура,
		|	СпрНоменклатура.ЭтоНабор КАК ЭтоНабор,
		|	СпрНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	СпрНоменклатура.Номинал КАК Номинал
		|ПОМЕСТИТЬ ТаблицаНоменклатура
		|ИЗ
		|	втТовары КАК втТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО втТовары.Номенклатура = СпрНоменклатура.Ссылка
		|ГДЕ
		|	НЕ СпрНоменклатура.ПометкаУдаления
		|	И НЕ СпрНоменклатура.ЭтоГруппа
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
		|	МАКСИМУМ(ЕСТЬNULL(ЦеныНоменклатуры.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК Период,
		|	ЕСТЬNULL(ЦеныНоменклатуры.ВидЦен, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ВидЦен,
		|	0 КАК Номинал,
		|	ТаблицаНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры
		|ПОМЕСТИТЬ ТаблицаМаксПериодЦен
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|ГДЕ
		|	ЦеныНоменклатуры.Период <= &Дата
		|	И ЦеныНоменклатуры.ВидЦен = &ВидЦены
		|	И ЦеныНоменклатуры.Актуальность
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ЦеныНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
		|	ЕСТЬNULL(ЦеныНоменклатуры.ВидЦен, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)),
		|	ТаблицаНоменклатура.ТипНоменклатуры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура,
		|	&Дата,
		|	&ВидЦены,
		|	0,
		|	ТаблицаНоменклатура.ТипНоменклатуры
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|ГДЕ
		|	ТаблицаНоменклатура.ЭтоНабор
		|	И ЦеныНоменклатуры.Номенклатура ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНоменклатура.Номенклатура,
		|	ТаблицаНоменклатура.ТипНоменклатуры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура,
		|	&Дата,
		|	&ВидЦены,
		|	ТаблицаНоменклатура.Номинал,
		|	ТаблицаНоменклатура.ТипНоменклатуры
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|ГДЕ
		|	ТаблицаНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНоменклатура.Номенклатура,
		|	ТаблицаНоменклатура.Номинал,
		|	ТаблицаНоменклатура.ТипНоменклатуры
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	ВидЦен,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаМаксПериодЦен.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ТаблицаМаксПериодЦен.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
		|			ТОГДА ТаблицаМаксПериодЦен.Номинал
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
		|	КОНЕЦ КАК Цена
		|ПОМЕСТИТЬ ТаблицаИтоговыхЦен
		|ИЗ
		|	ТаблицаМаксПериодЦен КАК ТаблицаМаксПериодЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТаблицаМаксПериодЦен.Период = ЦеныНоменклатуры.Период
		|			И ТаблицаМаксПериодЦен.ВидЦен = ЦеныНоменклатуры.ВидЦен
		|			И ТаблицаМаксПериодЦен.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ТаблицаИтоговыхЦен.Цена, 0) КАК Цена
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИтоговыхЦен КАК ТаблицаИтоговыхЦен
		|		ПО ТаблицаНоменклатура.Номенклатура = ТаблицаИтоговыхЦен.Номенклатура
		|";
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВидЦены", ЭтотОбъект.РозничныйВидЦены);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТаблицаТоваров", ИсходнаяТаблицаЦен);
	
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

#КонецОбласти

#Область ОтраслевыеПроцедурыИФункции

#Область ИндикацияСерийПоСрокуГодности

&НаСервере
Процедура ЗаполнитьУсловноеОформлениеФормыИндикацииСерийПоСрокамГодности()

	ИскомоеПоле1 = Новый ПолеКомпоновкиДанных("ТаблицаВыбора");
	ИскомоеПоле2 = Новый ПолеКомпоновкиДанных("ТаблицаВыбора.ТаблицаВыбораПредставлениеВладельца");
	
	// Установим новое оформление
	Для Каждого СтрокаТаблицыОформления Из ЭтотОбъект.ТаблицаИндикацииСерий Цикл
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		
		Отбор = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение   = Новый ПолеКомпоновкиДанных("ДеревоВыбора.ор_СрокГодности");
		Отбор.ВидСравнения    = ВидСравненияКомпоновкиДанных.Больше;
		Отбор.ПравоеЗначение  = СтрокаТаблицыОформления.ДатаС;
		
		Отбор = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ДеревоВыбора.ор_СрокГодности");
		Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		Отбор.ПравоеЗначение   = СтрокаТаблицыОформления.Дата;
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", СтрокаТаблицыОформления.Цвет);
		
		НовоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		НовоеПоле.Использование = Истина;
		НовоеПоле.Поле          = ИскомоеПоле1;
		
		НовоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		НовоеПоле.Использование = Истина;
		НовоеПоле.Поле          = ИскомоеПоле2;
		
		ЭлементУО.Представление = СтрШаблон(НСтр("ru = 'Значение срока годности между %1 и %2'"), СтрокаТаблицыОформления.ДатаС, СтрокаТаблицыОформления.Дата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_ОтображатьТолькоТоварыНаОстаткахПриИзменении(Элемент)
	
	НастройкиВыбора = Новый Структура;
	НастройкиВыбора.Вставить("ПоказыватьОстатокНоменклатуры"   , ПоказыватьОстатокНоменклатуры);
	НастройкиВыбора.Вставить("СкладОстатков"                   , СкладОстатков);
	НастройкиВыбора.Вставить("ОтображатьТолькоТоварыНаОстатках", ЭтотОбъект.ОтображатьТолькоТоварыНаОстатках);
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("НастройкиФормыВыбораДанныхПоискаПоШК", "", НастройкиВыбора);

КонецПроцедуры

#КонецОбласти
